### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (9 unchanged attributes hidden)


!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/67a1906df30e74d2fc8157064dcfef21.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/0b58038ef74f9eac5dfc6c1ef6a2b4c7.zip"
                # (1 unchanged attribute hidden)
            }
        }


-       handlers {
-           auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT" -> null
-           login            = "LOGIN_OPTIONAL" -> null
-           security_level   = "SECURE_OPTIONAL" -> null
-           url_regex        = ".*" -> null

-           script {
-               script_path = "auto" -> null
            }
        }


        # (8 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.perform-action will be updated in-place
!   resource "google_cloudfunctions_function" "perform-action" {
        id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action"
        name                  = "perform_action"
!       source_archive_object = "18d14af5cd65fe35a16110b1de84f1d6.zip" -> "6976ebde75175e5276fa239c2ea06de1.zip"
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.dev.google_datastore_index.adminAction1 will be created
+   resource "google_datastore_index" "adminAction1" {
+       ancestor = "NONE"
+       id       = (known after apply)
+       index_id = (known after apply)
+       kind     = "AdminAction"
+       project  = (known after apply)

+       properties {
+           direction = "ASCENDING"
+           name      = "action_uuid"
        }
+       properties {
+           direction = "ASCENDING"
+           name      = "create_time"
        }
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "gLFYvA==" -> (known after apply)
!       detect_md5hash   = "Z6GQbfMOdNL8gVcGTc/vIQ==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-67a1906df30e74d2fc8157064dcfef21.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "Z6GQbfMOdNL8gVcGTc/vIQ==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/67a1906df30e74d2fc8157064dcfef21.zip?generation=1635446798823834&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "67a1906df30e74d2fc8157064dcfef21.zip" -> "0b58038ef74f9eac5dfc6c1ef6a2b4c7.zip" # forces replacement
!       output_name      = "67a1906df30e74d2fc8157064dcfef21.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/67a1906df30e74d2fc8157064dcfef21.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.closure_js must be replaced
-/+ resource "google_storage_bucket_object" "closure_js" {
!       crc32c           = "3Cqwug==" -> (known after apply)
!       detect_md5hash   = "D6+dB/Q5ZaL/SZKrSeLZJg==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-compiled/js/fmltc.js" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "D6+dB/Q5ZaL/SZKrSeLZJg==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev/o/compiled%2Fjs%2Ffmltc.js?generation=1635308928400559&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "compiled/js/fmltc.js"
!       output_name      = "compiled/js/fmltc.js" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev/o/compiled%2Fjs%2Ffmltc.js" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "27fuMg==" -> (known after apply)
!       detect_md5hash   = "GNFK9c1l/jWhYRCx3oTx1g==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-18d14af5cd65fe35a16110b1de84f1d6.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "GNFK9c1l/jWhYRCx3oTx1g==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/18d14af5cd65fe35a16110b1de84f1d6.zip?generation=1635446798846923&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "18d14af5cd65fe35a16110b1de84f1d6.zip" -> "6976ebde75175e5276fa239c2ea06de1.zip" # forces replacement
!       output_name      = "18d14af5cd65fe35a16110b1de84f1d6.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/18d14af5cd65fe35a16110b1de84f1d6.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.
```
</details>